FREE2RP Community Rules
These rules apply across all platforms, including Discord and in-game.
1. Zero Tolerance for Hate & Harassment
No Hate Speech or Bigotry
This is an RP community—real-world prejudice has no place here.
Prohibited: Racism, sexism, homophobia, transphobia, religious intolerance, or any hate speech (in or out of character).
Roleplay is not an excuse for hate. Violators will be removed immediately.
No Harassment
Includes: Targeted insults, sexual harassment, threats, stalking, or unwanted contact after boundaries are set.
Examples of unacceptable behavior:
Spamming messages after being blocked.
Harassing players over RP via Discord/social media.
Creating group chats to mock, harass, or doxx others.
Sharing personal info/screenshots without consent.
Report harassment via ticket with evidence. We take this seriously.

2. Community Conduct
Off-Server Behavior
We won’t mediate personal drama, but hostile actions (doxxing, threats, etc.) may result in removal.
No Toxicity
Allowed: Constructive criticism.
Prohibited: Abuse, harassment, or targeted negativity toward players, staff, or the server.
Adult-Oriented Server
18+ only. Humor and discussions may include mature themes.

3. Account & Moderation Policies
Ban Appeals
Submit appeals at www.free2rp.com or Discord.gg/FREE2RP
Appeals are reviewed independently for fairness.
No Backseat Moderating
Report rule breaks via tickets—do not enforce rules publicly.
Ban Evasion & Alt Accounts
Prohibited: Using alts to evade bans, spy, or manipulate interactions.
All alternate accounts must be disclosed to staff.

4. Practical Rules
Ticket & Channel Use
Keep reports clear and respectful.
No spam, memes, or joke reports. Misuse may result in restrictions.
Naming Policy
Usernames (Discord/in-game) must be appropriate.
No slurs, offensive content, or impersonation.
Staff may request changes—refusal = removal.
No Advertising
Do not promote other servers/Discords without staff approval.

5. Community Spirit
Leave Drama at the Door
Bring positivity, fun, and creativity—not grudges.

6. Compensation Policy
We will not compensate the player base in instances where items are lost to causes outside of our control such as a server crash, network outage or unscheduled restart.
We will compensate for bugs within our scripts providing there is evidence of the item loss.


FREE2RP FiveM Server Rules
Roleplay-first, immersive, and fair play for all.
1. Core Roleplay Principles
Roleplay First
Stay in-character and engage in every scene.
If someone offers RP, reciprocate at all times.
No Breaking Character
Never complain about mechanics mid-scene.
Report serious issues (hate speech, harassment) immediately.
No Metagaming
Do not use OOC info (streams, Discord, etc.) in-character.
No Stream Sniping
Watching streams to gain an advantage is prohibited. Keep interactions authentic.
No Powergaming
Never force RP outcomes without giving others a chance to react.
Fail RP
Maintain high RP quality. Avoid disruptive outfits/behaviour that break immersion.

2. Conflict & Combat Rules
General Conflict
No Random Deathmatching (RDM): Initiate with verbal RP before attacking.
No Vehicle Deathmatching: Don’t use vehicles as weapons unless escaping.
No Camping Teleports/Ladders: Avoid ambushing players in no-counterplay areas.
Conflict Numbers
Turf/Property Defense: Only defend with those present—no reinforcements mid-fight.
Heists & Crime RP: Max 5 criminals vs. 8 police.
No Endless Conflict: Repeated attacks require RP resolution.
Post-Conflict Behavior
Stay in character when downed. No OOC trash talk.
New Life Rule (NLR): If executed, remember only vague details—not names/identifiers.
Pocket Wiping
Do not loot everything without an RP reason.

3. Exploits & Fair Play
No Exploiting
Report bugs/glitches—never abuse them.
Prohibited: Combat logging, money duping, respawn abuse.
Value Your Life (VYL)
Surrender if outgunned—or face severe consequences (permadeath, etc.).
Crime & Server Restarts
No Criminal Activity within 30 minutes before or after a server restart.

4. Harassment & Toxicity
In-Game Harassment
RP conflict is fine; personal targeting is not.
Harassment includes:
Forcing yourself into someone’s RP repeatedly.
Using multiple characters to provoke the same player.
Ignoring clear attempts to exit RP.
Not harassment:
Gang retaliation from actual storylines.
Long-term rivalries with engaged RP.

5. Special RP Restrictions
Graphic Content
No Erotic RP: Strictly prohibited.
No Bad Taste RP: Avoid real-life trauma topics (school shootings, suicide, etc.).
Ocean Dumping
Allowed for story purposes, but never force permadeath/memory loss.
Government/Job Rules
Corruption RP must be realistic.
Do not abuse job perks for OOC reasons.
No Copyright Music
Protect content creators—avoid copyrighted music in public.
